## 10.1 GroupBy Mechanics

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5)})

In [3]:
df

  key1 key2     data1     data2
0    a  one -0.797087 -0.194903
1    a  two  0.361653  0.390727
2    b  one -0.001405 -0.349539
3    b  two  0.285263  0.384267
4    a  one -1.357625 -0.100950

In [4]:
grouped = df['data1'].groupby(df['key1'])

In [5]:
grouped

In [6]:
grouped.mean()

key1
a   -0.597686
b    0.141929
Name: data1, dtype: float64

In [7]:
grouped2 = df['data2'].groupby(df['key2'])

In [8]:
grouped2.mean()

key2
one   -0.215131
two    0.387497
Name: data2, dtype: float64

In [9]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [10]:
means

key1  key2
a     one    -1.077356
      two     0.361653
b     one    -0.001405
      two     0.285263
Name: data1, dtype: float64

In [11]:
means.unstack()

key2       one       two
key1
a    -1.077356  0.361653
b    -0.001405  0.285263

In [12]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])

In [13]:
years = np.array([2005, 2005, 2006, 2005, 2006])

In [14]:
df['data1'].groupby([states, years]).mean()

California  2005    0.361653
            2006   -0.001405
Ohio        2005   -0.255912
            2006   -1.357625
Name: data1, dtype: float64

In [15]:
df.groupby('key1').mean()

         data1     data2
key1
a    -0.597686  0.031625
b     0.141929  0.017364

In [16]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one  -1.077356 -0.147927
     two   0.361653  0.390727
b    one  -0.001405 -0.349539
     two   0.285263  0.384267

In [17]:
df

  key1 key2     data1     data2
0    a  one -0.797087 -0.194903
1    a  two  0.361653  0.390727
2    b  one -0.001405 -0.349539
3    b  two  0.285263  0.384267
4    a  one -1.357625 -0.100950

In [18]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

### Iterating Over Groups

In [19]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one -0.797087 -0.194903
1    a  two  0.361653  0.390727
4    a  one -1.357625 -0.100950
b
  key1 key2     data1     data2
2    b  one -0.001405 -0.349539
3    b  two  0.285263  0.384267

In [20]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print((k1, k2))
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one -0.797087 -0.194903
4    a  one -1.357625 -0.100950
('a', 'two')
  key1 key2     data1     data2
1    a  two  0.361653  0.390727
('b', 'one')
  key1 key2     data1     data2
2    b  one -0.001405 -0.349539
('b', 'two')
  key1 key2     data1     data2
3    b  two  0.285263  0.384267

In [21]:
pieces = dict(list(df.groupby('key1')))

In [22]:
pieces['b']

  key1 key2     data1     data2
2    b  one -0.001405 -0.349539
3    b  two  0.285263  0.384267

In [23]:
pieces['a']

  key1 key2     data1     data2
0    a  one -0.797087 -0.194903
1    a  two  0.361653  0.390727
4    a  one -1.357625 -0.100950

In [24]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [25]:
grouped = df.groupby(df.dtypes, axis=1)

In [26]:
grouped

In [27]:
for dtype, group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0 -0.797087 -0.194903
1  0.361653  0.390727
2 -0.001405 -0.349539
3  0.285263  0.384267
4 -1.357625 -0.100950
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

### Select a Column or Subset of Columns

In [28]:
df.groupby('key1')['data1']

In [29]:
df.groupby('key1')[['data2']]

In [30]:
df['data1'].groupby(df['key1'])

In [31]:
df[['data2']].groupby(df['key1'])

In [32]:
df.groupby(['key1', 'key2'])[['data2']].mean()

              data2
key1 key2
a    one  -0.147927
     two   0.390727
b    one  -0.349539
     two   0.384267

In [33]:
s_grouped = df.groupby(['key1', 'key2'])['data2']

In [34]:
s_grouped

In [35]:
s_grouped.mean()

key1  key2
a     one    -0.147927
      two     0.390727
b     one    -0.349539
      two     0.384267
Name: data2, dtype: float64

### Grouping with Dicts and Series

In [36]:
people = pd.DataFrame(np.random.randn(5, 5),
                      columns=['a', 'b', 'c', 'd', 'e'],
                      index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [37]:
people.iloc[2:3, [1, 2]] = np.nan # Add a few NA values

In [38]:
people

               a         b         c         d         e
Joe     0.683157  0.631199 -1.377416 -0.202835 -0.277532
Steve   0.585750  0.217250 -0.046256 -0.317634  0.406377
Wes     0.066338       NaN       NaN -0.229374  0.011357
Jim     0.594821  0.287191  0.515219 -1.145414 -0.515954
Travis  0.133309  0.570878  0.367237  0.871120  1.262539

In [39]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue', 
           'd': 'blue', 'e': 'red', 'f':'orange'}

In [40]:
by_column = people.groupby(mapping, axis=1)

In [41]:
by_column.sum()

            blue       red
Joe    -1.580251  1.036824
Steve  -0.363890  1.209377
Wes    -0.229374  0.077696
Jim    -0.630196  0.366059
Travis  1.238357  1.966726

In [42]:
map_series = pd.Series(mapping)

In [43]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [44]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [45]:
people.groupby(map_series, axis=1).mean()

            blue       red
Joe    -0.790125  0.345608
Steve  -0.181945  0.403126
Wes    -0.229374  0.038848
Jim    -0.315098  0.122020
Travis  0.619178  0.655575

### Grouping with Functions

In [46]:
people.groupby(len).sum()

          a         b         c         d         e
3  1.344317  0.918391 -0.862197 -1.577623 -0.782128
5  0.585750  0.217250 -0.046256 -0.317634  0.406377
6  0.133309  0.570878  0.367237  0.871120  1.262539

In [47]:
people

               a         b         c         d         e
Joe     0.683157  0.631199 -1.377416 -0.202835 -0.277532
Steve   0.585750  0.217250 -0.046256 -0.317634  0.406377
Wes     0.066338       NaN       NaN -0.229374  0.011357
Jim     0.594821  0.287191  0.515219 -1.145414 -0.515954
Travis  0.133309  0.570878  0.367237  0.871120  1.262539

In [48]:
key_list = ['one', 'one', 'one', 'two', 'two']

In [49]:
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one  0.066338  0.631199 -1.377416 -0.229374 -0.277532
  two  0.594821  0.287191  0.515219 -1.145414 -0.515954
5 one  0.585750  0.217250 -0.046256 -0.317634  0.406377
6 two  0.133309  0.570878  0.367237  0.871120  1.262539

### Grouping by Index Levels

In [50]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
                                     [1, 3, 5, 1, 3]],
                                    names=['cty', 'tenor'])

In [51]:
columns

MultiIndex([('US', 1),
            ('US', 3),
            ('US', 5),
            ('JP', 1),
            ('JP', 3)],
           names=['cty', 'tenor'])

In [52]:
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)

In [53]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -0.924563  1.317659 -3.020106  2.356310  0.756303
1      0.637641 -0.109088 -0.526210 -0.122377 -1.265956
2     -0.799849 -0.408841  1.228000  1.200175  0.237341
3     -1.413123  1.209267 -0.298955 -0.515657  0.982154

In [54]:
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3